app/controllers/api/v1/decision_factors_controller.rb

SELECT "decision_factors".* FROM "decision_factors"
---
 def index
   @decision_factor = DecisionFactor.all