app/controllers/api/v1/decisions_controller.rb

SELECT "decisions".* FROM "decisions"
---
 def index
   @decision = Decision.all