app/controllers/api/v1/factors_controller.rb

SELECT "factors".* FROM "factors"
---
 def index
   @factor = Factor.all

SELECT  "factors".* FROM "factors" WHERE "factors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
 def show
  @factor = Factor.find(params[:id])